# yaer-forge Brewfile
# Install everything: brew bundle install

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"

# --- Editor ---
brew "neovim"

# --- Shell & Prompt ---
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Shell History & Navigation ---
brew "atuin"
brew "zoxide"
brew "fzf"

# --- Modern CLI Replacements ---
brew "ripgrep"       # rg  — fast grep
brew "fd"            # fd  — fast find
brew "bat"           # cat with syntax highlighting
brew "eza"           # ls  with icons and git info
brew "jq"            # JSON processor
brew "yq"            # YAML/TOML/XML processor (like jq)

# --- Git Tools ---
brew "git-delta"     # better git diffs
brew "lazygit"       # TUI git client
brew "tig"           # read-only git history browser
brew "gh"            # GitHub CLI

# --- File Managers ---
brew "yazi"          # async TUI file manager with image preview
brew "broot"         # fuzzy tree navigator

# --- HTTP / API ---
brew "xh"            # fast HTTPie-compatible CLI

# --- System Monitors ---
brew "btop"          # beautiful resource monitor
brew "dust"          # visual disk usage tree
brew "duf"           # readable df replacement

# --- Data & Docs ---
brew "glow"          # render Markdown in terminal
brew "fx"            # interactive JSON explorer

# --- Docker ---
brew "lazydocker"    # TUI for Docker

# --- Terminal Multiplexer ---
brew "zellij"        # modern terminal multiplexer

# --- Productivity ---
brew "just"          # modern Makefile replacement
brew "tealdeer"      # fast tldr (practical command examples)
brew "navi"          # interactive cheatsheet tool
brew "fastfetch"     # fast system info (neofetch replacement)
brew "gping"         # ping with real-time graph

# --- AI & Extras ---
brew "mods"          # pipe text through an LLM inline
brew "onefetch"      # git repo summary (like fastfetch for repos)
brew "tokei"         # fast code stats by language
brew "viddy"         # modern watch with diff highlighting
brew "gum"           # interactive components for shell scripts
